# MassDensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..MassDensity Property
SpecTypeId Class See Also
---
Mass Density, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MassDensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDensity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDensity {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace